УТ_для_edt/src/InformationRegisters/CRM_ОчередьОтложенногоВыполненияТриггеров/CRM_ОчередьОтложенногоВыполненияТриггеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ОчередьОтложенногоВыполненияТриггеров</name>
  <attributes>
    <name>СрокВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗапусков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Триггер</name>
    <type>
      <types>CatalogRef.CRM_Триггеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектТриггера</name>
    <type>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектДействия</name>
    <type>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/CRM_СобытияТриггеров/CRM_СобытияТриггеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_СобытияТриггеров</name>
  <enumValues>
    <name>ПриЗаписи</name>
  </enumValues>
  <enumValues>
    <name>ПередЗаписью</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаПроведения</name>
  </enumValues>
  <enumValues>
    <name>ВыполнитьПереопределяемуюКоманду</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаОповещения</name>
  </enumValues>
  <enumValues>
    <name>ПередЗаписьюНаСервере</name>
  </enumValues>
  <enumValues>
    <name>ПриСозданииНаСервере</name>
  </enumValues>
  <enumValues>
    <name>ПослеЗаписиНаСервере</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_ПериодичностьОповещений/CRM_ПериодичностьОповещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ПериодичностьОповещений</name>
  <enumValues>
    <name>Минута</name>
  </enumValues>
  <enumValues>
    <name>Час</name>
  </enumValues>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/CRM_Триггеры/CRM_Триггеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_Триггеры</name>
  <attributes>
    <name>Действие</name>
    <type>
      <types>CatalogRef.CRM_ДействияТриггеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеСрабатывания</name>
    <type>
      <types>CatalogRef.CRM_УсловияСрабатыванияТриггеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиУсловий</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиДействий</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПовторноеСрабатывание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВЛоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
      <types>CatalogRef.CRM_ТочкиМаршрутов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНастроекУсловия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНастроекДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтложенноеВыполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтложеноНа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтложеноПериодичность</name>
    <type>
      <types>EnumRef.CRM_ПериодичностьОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПовторятьПриОшибке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПовторятьЧерез</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьВСостоянииИнтереса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийКарта</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
      <types>CatalogRef.CRM_КартыМаршрутов</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_УсловияСрабатыванияТриггеров/CRM_УсловияСрабатыванияТриггеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_УсловияСрабатыванияТриггеров</name>
  <predefined>
    <items>
      <name>ПриПроведенииКоммерческогоПредложенияПоИнтересу</name>
      <description>Обработка проведения: Коммерческое предложение клиенту (по Интересу)</description>
    </items>
    <items>
      <name>ПриПроведенииСчетаНаОплатуПоИнтересу</name>
      <description>Обработка проведения: Счет на оплату (по Интересу)</description>
    </items>
    <items>
      <name>ПоРасписанию</name>
      <description>По расписанию</description>
    </items>
    <items>
      <name>ПисьмоОтНовогоКлиента</name>
      <description>Получено письмо от нового клиента</description>
    </items>
    <items>
      <name>ВходящийТелефонныйЗвонокПоИнтересуКлиента</name>
      <description>При входящем звонке (по интересу)</description>
    </items>
    <items>
      <name>ВходящееЭлектронноеПисьмоПоИнтересуКлиента</name>
      <description>При входящем письме (по интересу)</description>
    </items>
    <items>
      <name>ВходящееСообщениеЧатаПоИнтересуКлиента</name>
      <description>При входящем сообщение чата (по интересу)</description>
    </items>
    <items>
      <name>ПриВыполненииЗадачи</name>
      <description>При выполнении задачи</description>
    </items>
    <items>
      <name>ПриВыполненииЗадачиПоИнтересу</name>
      <description>При выполнении задачи (по интересу)</description>
    </items>
    <items>
      <name>ПриДоставкеПоИнтересу</name>
      <description>При доставке (по интересу)</description>
    </items>
    <items>
      <name>ПриЗавершенииВзаимодействияПоИнтересу</name>
      <description>При завершении взаимодействия (по интересу)</description>
    </items>
    <items>
      <name>CRM_Модуль_ПриЗаписиЗаказаКлиента</name>
      <description>При записи заказа клиента</description>
    </items>
    <items>
      <name>ПриОплатеПоИнтересу</name>
      <description>При оплате (по интересу)</description>
    </items>
    <items>
      <name>ПриОтгрузкеПоИнтересу</name>
      <description>При отгрузке (по интересу)</description>
    </items>
    <items>
      <name>ПриВыбореНовогоСостоянияИнтереса</name>
      <description>При переходе в состояние интереса</description>
    </items>
    <items>
      <name>ПриПереходеНаЭтапБизнесПроцесса</name>
      <description>При переходе на этап бизнес процесса</description>
    </items>
    <items>
      <name>ПриПринятииКИсполнениюЗадачи</name>
      <description>При принятии к исполнению задачи</description>
    </items>
    <items>
      <name>ПриИзмененииТекущегоСостоянияИнтереса</name>
      <description>При смене текущего состояния интереса</description>
    </items>
  </predefined>
  <attributes>
    <name>ИспользоватьСКД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСтандартнаяОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаПроверки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектДействия</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбъектОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбъектОбработкиПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКОбработке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимОтладки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>EnumRef.CRM_СобытияТриггеров</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыОбработкиПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыОбработки</name>
    <attributes>
      <name>ОбъектОбработки</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_ДействияТриггеров/CRM_ДействияТриггеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ДействияТриггеров</name>
  <predefined>
    <items>
      <name>СоздатьВзаимодействие</name>
      <description>Запланировать взаимодействие</description>
    </items>
    <items>
      <name>ПересчетПотенциалаВИнтересе</name>
      <description>Заполнить  поле &quot;Ожидаемая  выручка&quot; </description>
    </items>
    <items>
      <name>ОтказЗаписи</name>
      <description>Запретить запись</description>
    </items>
    <items>
      <name>ЗапретитьРедактированиеДокументаКоммерческоеПредложение</name>
      <description>Запретить редактирование документа Коммерческое предложение</description>
    </items>
    <items>
      <name>СтартПроизвольногоБП</name>
      <description>Запустить бизнес-процесс</description>
    </items>
    <items>
      <name>ИзменениеСостоянияИнтереса</name>
      <description>Изменить состояние интереса</description>
    </items>
    <items>
      <name>ИзменитьТемуИнтереса</name>
      <description>Изменить тему интереса</description>
    </items>
    <items>
      <name>ОповещениеПочта</name>
      <description>Отправить E-mail</description>
    </items>
    <items>
      <name>ОповещениеСМС</name>
      <description>Отправить SMS</description>
    </items>
    <items>
      <name>CRM_Модуль_ПривязкаЗаказовКИнтересам</name>
      <description>Привязка заказов к интересам</description>
    </items>
    <items>
      <name>ПроверитьНаличиеДокументов</name>
      <description>Проверить наличие документов</description>
    </items>
    <items>
      <name>РассылкаПоСегменту</name>
      <description>Рассылка электронных писем  клиентам в сегменте</description>
    </items>
    <items>
      <name>СозданиеЗаявкиНаОснованииПисьма</name>
      <description>Создание заявки(лида) на основании письма</description>
    </items>
    <items>
      <name>ЗаявкаССайта</name>
      <description>Создание интереса клиента (лида) на основание письма-заявки</description>
    </items>
    <items>
      <name>СоздатьЗадачуПоОбъекту</name>
      <description>Создать задачу</description>
    </items>
    <items>
      <name>ОповещениеНапоминание</name>
      <description>Создать напоминание</description>
    </items>
    <items>
      <name>ГенерацияИнтересаПоИнтересу</name>
      <description>Генерация интереса по интересу</description>
    </items>
  </predefined>
  <attributes>
    <name>ОбработкаДействия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКОбработке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимОтладки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСтандартнаяОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеТипов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыДействия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/CRM_ТриггерыСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// CRM триггеры сервер
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вернуть обработку действия
//
// Параметры:
//  Триггер	 - СправочникСсылка	 - Выполняемы триггер.
// 
// Возвращаемое значение:
//  ВнешняяОбработка, Неопределено - Возвращает обработку действия, либо Неопределено.
//
Функция ВернутьОбработкуДействия(Триггер) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Триггер.Действие.РежимОтладки Тогда
		ИмяВременногоФайла = Триггер.Действие.ПутьКОбработке;
		ФайлНаДиске = Новый Файл(ИмяВременногоФайла);
		Если ФайлНаДиске.Существует() Тогда
			Обработка = ВнешниеОбработки.Создать(ИмяВременногоФайла, ложь);
			Возврат Обработка;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе	
	//	Обработка = CRM_ТриггерыПовтИсп.ВернутьОбработкуДействия(Триггер);
		ОбработкаПроверки = Триггер.Действие.ОбработкаДействия.Получить();
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("epf");
		ОбработкаПроверки.Записать(ИмяВременногоФайла);
		
		ПараметрыЗащиты = Новый("ОписаниеЗащитыОтОпасныхДействий"+"");
		ПараметрыЗащиты.ПредупреждатьОбОпасныхДействиях = ЛОЖЬ;                                            
		
		Данные = Новый ДвоичныеДанные(ИмяВременногоФайла);
		АдресХранилища = ПоместитьВоВременноеХранилище(Данные, Новый УникальныйИдентификатор());
		
		Обработка =  ВнешниеОбработки.Создать(ВнешниеОбработки.Подключить(АдресХранилища,,Ложь, ПараметрыЗащиты), Ложь);
		Возврат Обработка;
	КонецЕсли;	
	
КонецФункции	

// Вернуть обработку условия
//
// Параметры:
//  Триггер	 - СправочникСсылка	 - Выполняемы триггер.
// 
// Возвращаемое значение:
//  ВнешняяОбработка - Возвращает обработку условия.
//
Функция ВернутьОбработкуУсловия(Триггер) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяВременногоФайла = Триггер.УсловиеСрабатывания.ПутьКОбработке;
	
	Обработка = ВнешниеОбработки.Создать(ИмяВременногоФайла, ложь);
	Возврат Обработка;
КонецФункции

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма				 - ФормаКлиентскогоПриложения	 - Передаваемая форма.
//  Отказ				 - Булево			 - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево			 - Признак выполнения стандартной (системной) обработки события.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Триггер = ПолучитьТриггер(Форма.Объект.Ссылка, Перечисления.CRM_СобытияТриггеров.ПриСозданииНаСервере);
	
	Если НЕ Триггер = Неопределено Тогда
		Если Триггер.Действие.РежимОтладки Тогда
			Обработка = ВернутьОбработкуДействия(Триггер);
		Иначе	
			Обработка = CRM_ТриггерыПовтИсп.ВернутьОбработкуДействия(Триггер);
		КонецЕсли;
		Попытка
			НастройкиДействий = Триггер.НастройкиДействий.Получить();
			Если ТипЗнч(НастройкиДействий) = Тип("Структура") Тогда
				Для Каждого КлючИЗначение Из НастройкиДействий Цикл
					Если ТипЗнч(КлючИЗначение.Значение) = Тип("Массив") Тогда
						Если НЕ Обработка.Метаданные().ТабличныеЧасти.Найти(КлючИЗначение.Ключ) = Неопределено Тогда
							Обработка[КлючИЗначение.Ключ].Очистить();
							Для Каждого СтруктураСтроки Из КлючИЗначение.Значение Цикл
								НоваяСтрока = Обработка[КлючИЗначение.Ключ].Добавить();
								Для Каждого КлючИЗначениеСтроки Из СтруктураСтроки Цикл
									Если НЕ Обработка.Метаданные().ТабличныеЧасти[КлючИЗначение.Ключ].Реквизиты.Найти(КлючИЗначениеСтроки.Ключ) = Неопределено Тогда
										
										НоваяСтрока[КлючИЗначениеСтроки.Ключ] = КлючИЗначениеСтроки.Значение;
										
									КонецЕсли;
								КонецЦикла;
							КонецЦикла;
						КонецЕсли;
					Иначе
						Если Обработка.Метаданные().Реквизиты.Найти(КлючИЗначение.Ключ) <> Неопределено Тогда
							Обработка[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Обработка.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
			
			Если Триггер.ВключатьВЛоги Тогда
				Справочники.CRM_Триггеры.ЗаписатьОбработанныйОбъектТриггера(Триггер, Форма.Объект.Ссылка);
			КонецЕсли;
		Исключение
			Справочники.CRM_Триггеры.ЗаписатьОшибкуТриггера(Триггер, Форма.Объект.Ссылка, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения	 - Передаваемая форма.
//  Отказ			 - Булево			 - Признак отказа от создания формы.
//  ТекущийОбъект	 - СправочникОбъект	 - Записываемый объект.
//  ПараметрыЗаписи	 - Структура		 - Структура, содержащая параметры записи.
//
Процедура ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Триггер = ПолучитьТриггер(Форма.Объект.Ссылка, Перечисления.CRM_СобытияТриггеров.ПередЗаписьюНаСервере);
	
	Если НЕ Триггер = Неопределено Тогда
		Если Триггер.Действие.РежимОтладки Тогда
			Обработка = ВернутьОбработкуДействия(Триггер);
		Иначе	
			Обработка = CRM_ТриггерыПовтИсп.ВернутьОбработкуДействия(Триггер);
		КонецЕсли;
		Попытка
			НастройкиДействий = Триггер.НастройкиДействий.Получить();
			Если ТипЗнч(НастройкиДействий) = Тип("Структура") Тогда
				Для Каждого КлючИЗначение Из НастройкиДействий Цикл
					Если ТипЗнч(КлючИЗначение.Значение) = Тип("Массив") Тогда
						Если НЕ Обработка.Метаданные().ТабличныеЧасти.Найти(КлючИЗначение.Ключ) = Неопределено Тогда
							Обработка[КлючИЗначение.Ключ].Очистить();
							Для Каждого СтруктураСтроки Из КлючИЗначение.Значение Цикл
								НоваяСтрока = Обработка[КлючИЗначение.Ключ].Добавить();
								Для Каждого КлючИЗначениеСтроки Из СтруктураСтроки Цикл
									Если НЕ Обработка.Метаданные().ТабличныеЧасти[КлючИЗначение.Ключ].Реквизиты.Найти(КлючИЗначениеСтроки.Ключ) = Неопределено Тогда
										
										НоваяСтрока[КлючИЗначениеСтроки.Ключ] = КлючИЗначениеСтроки.Значение;
										
									КонецЕсли;
								КонецЦикла;
							КонецЦикла;
						КонецЕсли;
					Иначе
						Обработка[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Обработка.ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
			Если Триггер.ВключатьВЛоги Тогда
				Справочники.CRM_Триггеры.ЗаписатьОбработанныйОбъектТриггера(Триггер, Форма.Объект.Ссылка);
			КонецЕсли;
		Исключение
			Справочники.CRM_Триггеры.ЗаписатьОшибкуТриггера(Триггер, Форма.Объект.Ссылка, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения - Передаваемая форма.
//  ТекущийОбъект	 - СправочникОбъект	 - Записываемый объект. 
//  ПараметрыЗаписи	 - Структура - Структура, содержащая параметры записи. 
//
Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Триггер = ПолучитьТриггер(Форма.Объект.Ссылка, Перечисления.CRM_СобытияТриггеров.ПослеЗаписиНаСервере);
	
	Если НЕ Триггер = Неопределено Тогда
		Если Триггер.Действие.РежимОтладки Тогда
			Обработка = ВернутьОбработкуДействия(Триггер);
		Иначе	
			Обработка = CRM_ТриггерыПовтИсп.ВернутьОбработкуДействия(Триггер);
		КонецЕсли;
		Попытка
			НастройкиДействий = Триггер.НастройкиДействий.Получить();
			Если ТипЗнч(НастройкиДействий) = Тип("Структура") Тогда
				Для Каждого КлючИЗначение Из НастройкиДействий Цикл
					Если ТипЗнч(КлючИЗначение.Значение) = Тип("Массив") Тогда
						Если НЕ Обработка.Метаданные().ТабличныеЧасти.Найти(КлючИЗначение.Ключ) = Неопределено Тогда
							Обработка[КлючИЗначение.Ключ].Очистить();
							Для Каждого СтруктураСтроки Из КлючИЗначение.Значение Цикл
								НоваяСтрока = Обработка[КлючИЗначение.Ключ].Добавить();
								Для Каждого КлючИЗначениеСтроки Из СтруктураСтроки Цикл
									Если НЕ Обработка.Метаданные().ТабличныеЧасти[КлючИЗначение.Ключ].Реквизиты.Найти(КлючИЗначениеСтроки.Ключ) = Неопределено Тогда
										
										НоваяСтрока[КлючИЗначениеСтроки.Ключ] = КлючИЗначениеСтроки.Значение;
										
									КонецЕсли;
								КонецЦикла;
							КонецЦикла;
						КонецЕсли;
					Иначе
						Обработка[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Обработка.ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи);
			Если Триггер.ВключатьВЛоги Тогда
				Справочники.CRM_Триггеры.ЗаписатьОбработанныйОбъектТриггера(Триггер, Форма.Объект.Ссылка);
			КонецЕсли;
		Исключение
			Справочники.CRM_Триггеры.ЗаписатьОшибкуТриггера(Триггер, Форма.Объект.Ссылка, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТриггер(Источник, Событие)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_Триггеры.Ссылка
	               |ИЗ
	               |	Справочник.CRM_Триггеры КАК CRM_Триггеры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_УсловияСрабатыванияТриггеров.ОбъектыОбработки КАК CRM_УсловияСрабатыванияТриггеровОбъектыОбработки
	               |		ПО CRM_Триггеры.УсловиеСрабатывания = CRM_УсловияСрабатыванияТриггеровОбъектыОбработки.Ссылка
	               |			И (CRM_УсловияСрабатыванияТриггеровОбъектыОбработки.ОбъектОбработки = &ОбъектОбработки)
	               |			И (CRM_УсловияСрабатыванияТриггеровОбъектыОбработки.Ссылка.Событие = &Событие)
	               |ГДЕ
	               |	CRM_Триггеры.Действует
	               |	И НЕ CRM_Триггеры.Действие = ЗНАЧЕНИЕ(Справочник.CRM_ДействияТриггеров.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Событие"			, Событие);
	Запрос.УстановитьПараметр("ОбъектОбработки"	, ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Источник)));
	ВыборкаТриггеров = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаТриггеров.Следующий() Цикл
		
		Возврат ВыборкаТриггеров.Ссылка;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьОбработкуДействийДляКлиента(Источник, Событие) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CRM_Триггеры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CRM_Триггеры КАК CRM_Триггеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_УсловияСрабатыванияТриггеров.ОбъектыОбработки КАК CRM_УсловияСрабатыванияТриггеровОбъектыОбработки
	|		ПО CRM_Триггеры.УсловиеСрабатывания = CRM_УсловияСрабатыванияТриггеровОбъектыОбработки.Ссылка
	|			И (CRM_УсловияСрабатыванияТриггеровОбъектыОбработки.ОбъектОбработки = &ОбъектОбработки)
	|			И (CRM_УсловияСрабатыванияТриггеровОбъектыОбработки.Ссылка.Событие = &Событие)
	|			И (НЕ CRM_Триггеры.Действие = ЗНАЧЕНИЕ(Справочник.CRM_ДействияТриггеров.ПустаяСсылка))
	|			И (CRM_Триггеры.Действует)";
	Запрос.УстановитьПараметр("Событие"			, Событие);
	Запрос.УстановитьПараметр("ОбъектОбработки"	, ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Источник)));
	ВыборкаТриггеров = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаТриггеров.Следующий() Цикл
		
		НастройкиДействий = ВыборкаТриггеров.Ссылка.НастройкиДействий.Получить();
		
		АдресХранилища = ПоместитьВоВременноеХранилище(ВыборкаТриггеров.Ссылка.Действие.ОбработкаДействия.Получить(), Новый УникальныйИдентификатор());
		
		Возврат Новый Структура("ОбработкаДействий,НастройкиДействий",ВнешниеОбработки.Подключить(АдресХранилища),НастройкиДействий);;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Процедура яCRM_ТриггерыПередЗаписьюОбъекта(Источник, Отказ, РежимЗаписи = Неопределено, РежимПроведения = Неопределено) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ЭлементСостава = Метаданные.ОбщиеРеквизиты.ОбластьДанныхОсновныеДанные.Состав.Найти(Источник.Метаданные());
	Если  ЭлементСостава = Неопределено Или ЭлементСостава.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.НеИспользовать Тогда Возврат КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ Источник.ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда
		Источник.ДополнительныеСвойства.Вставить("ЭтоНовый", Источник.Ссылка.Пустая());
	КонецЕсли;	
	Если Источник.ДополнительныеСвойства.Свойство("НеЗапускатьТриггер") Тогда Возврат КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_Триггеры.Ссылка КАК Ссылка,
	               |	CRM_Триггеры.УсловиеСрабатывания КАК УсловиеСрабатывания,
	               |	CRM_Триггеры.Действие КАК Действие
	               |ИЗ
	               |	Справочник.CRM_Триггеры КАК CRM_Триггеры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_УсловияСрабатыванияТриггеров.ОбъектыОбработки КАК CRM_УсловияСрабатыванияТриггеровОбъектыОбработки
	               |		ПО CRM_Триггеры.УсловиеСрабатывания = CRM_УсловияСрабатыванияТриггеровОбъектыОбработки.Ссылка
	               |			И (CRM_УсловияСрабатыванияТриггеровОбъектыОбработки.ОбъектОбработки = &ОбъектОбработки)
	               |			И (CRM_УсловияСрабатыванияТриггеровОбъектыОбработки.Ссылка.Событие = ЗНАЧЕНИЕ(Перечисление.CRM_СобытияТриггеров.ПередЗаписью))
	               |ГДЕ
	               |	CRM_Триггеры.Действует";
	Запрос.УстановитьПараметр("ОбъектОбработки", ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Источник)));
	ВыборкаТриггеров = Запрос.Выполнить().Выбрать();
	Пока ВыборкаТриггеров.Следующий() Цикл
		Если ВыборкаТриггеров.УсловиеСрабатывания.ПометкаУдаления Тогда
			Справочники.CRM_Триггеры.ЗаписатьОшибкуТриггера(ВыборкаТриггеров.Ссылка, Источник, НСтр("ru='Условие срабатывания триггера помечено на удаление!';en='Trigger condition is marked for deleting!'"));
			Продолжить;
		КонецЕсли;
		Если ВыборкаТриггеров.Действие.ПометкаУдаления Тогда
			Справочники.CRM_Триггеры.ЗаписатьОшибкуТриггера(ВыборкаТриггеров.Ссылка, Источник, НСтр("ru='Действие триггера помечено на удаление!';en='This trigger action is marked for deletion!'"));
			Продолжить;
		КонецЕсли;
		Если НЕ Справочники.CRM_Триггеры.ПроверитьПовторноеИспользование(ВыборкаТриггеров.Ссылка, Источник) Тогда Продолжить КонецЕсли;
		ОбъектыДействия = Неопределено;
		ПроверкаПрошла = Справочники.CRM_Триггеры.ПроверитьУсловияТриггера(ВыборкаТриггеров.Ссылка, Источник, ОбъектыДействия);
		Если ПроверкаПрошла Тогда
			Если ОбъектыДействия<>Неопределено И ТипЗнч(ОбъектыДействия) = Тип("Массив") И ОбъектыДействия.Количество()>0 Тогда
				Для Каждого ОбъектДействияСсылка Из ОбъектыДействия Цикл
					ОбъектДействия = ОбъектДействияСсылка.ПолучитьОбъект();
					Попытка
						СообщениеДействия = "";
						ТриггерВыполнен = Справочники.CRM_Триггеры.ВыполнитьТриггер(ВыборкаТриггеров.Ссылка, ОбъектДействия, Источник, Отказ, СообщениеДействия);
						Если ОбъектДействия.ДополнительныеСвойства.Свойство("ОбъектИзменен") Тогда
							ОбъектДействия.ДополнительныеСвойства.Удалить("ОбъектИзменен");
							ОбъектДействия.Записать();
						КонецЕсли;
						Если ТриггерВыполнен Тогда // И НЕ ВыборкаТриггеров.Ссылка.РазрешитьПовторноеСрабатывание
							Справочники.CRM_Триггеры.ЗаписатьОбработанныйОбъектТриггера(ВыборкаТриггеров.Ссылка, ОбъектДействия, Источник, СообщениеДействия);
						ИначеЕсли НЕ ТриггерВыполнен Тогда
							Справочники.CRM_Триггеры.ЗаписатьОшибкуТриггера(ВыборкаТриггеров.Ссылка, ОбъектДействия, ?(ЗначениеЗаполнено(СообщениеДействия), СообщениеДействия, "Действие не выполнено."));		
						КонецЕсли;
					Исключение
						Справочники.CRM_Триггеры.ЗаписатьОшибкуТриггера(ВыборкаТриггеров.Ссылка, ОбъектДействия, ОписаниеОшибки());
						ДобавитьОповещениеПоТриггеру(ВыборкаТриггеров.Ссылка);
					КонецПопытки;
				КонецЦикла;
			Иначе
				Попытка
					СообщениеДействия = "";
					ТриггерВыполнен = Справочники.CRM_Триггеры.ВыполнитьТриггер(ВыборкаТриггеров.Ссылка, Источник, Источник, Отказ, СообщениеДействия);
					Если ТриггерВыполнен Тогда // И НЕ ВыборкаТриггеров.Ссылка.РазрешитьПовторноеСрабатывание
						Справочники.CRM_Триггеры.ЗаписатьОбработанныйОбъектТриггера(ВыборкаТриггеров.Ссылка, Источник, Источник, СообщениеДействия);
					ИначеЕсли НЕ ТриггерВыполнен Тогда
						Справочники.CRM_Триггеры.ЗаписатьОшибкуТриггера(ВыборкаТриггеров.Ссылка, Источник, ?(ЗначениеЗаполнено(СообщениеДействия), СообщениеДействия, "Действие не выполнено."));		
					КонецЕсли;
				Исключение
					Справочники.CRM_Триггеры.ЗаписатьОшибкуТриггера(ВыборкаТриггеров.Ссылка, Источник, ОписаниеОшибки());
					ДобавитьОповещениеПоТриггеру(ВыборкаТриггеров.Ссылка);
				КонецПопытки;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

Процедура яCRM_ТриггерыПриЗаписиОбъекта(Источник, Отказ, РежимПроведения = Неопределено) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ЭлементСостава = Метаданные.ОбщиеРеквизиты.ОбластьДанныхОсновныеДанные.Состав.Найти(Источник.Метаданные());
	Если  ЭлементСостава = Неопределено Или ЭлементСостава.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.НеИспользовать Тогда Возврат КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Источник.ДополнительныеСвойства.Свойство("НеЗапускатьТриггер") Тогда Возврат КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_Триггеры.Ссылка КАК Ссылка,
	               |	CRM_Триггеры.ОтложенноеВыполнение КАК ОтложенноеВыполнение,
	               |	CRM_Триггеры.ПовторятьПриОшибке КАК ПовторятьПриОшибке,
	               |	CRM_Триггеры.Действие КАК Действие,
	               |	CRM_Триггеры.УсловиеСрабатывания КАК УсловиеСрабатывания
	               |ИЗ
	               |	Справочник.CRM_Триггеры КАК CRM_Триггеры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_УсловияСрабатыванияТриггеров.ОбъектыОбработки КАК CRM_УсловияСрабатыванияТриггеровОбъектыОбработки
	               |		ПО CRM_Триггеры.УсловиеСрабатывания = CRM_УсловияСрабатыванияТриггеровОбъектыОбработки.Ссылка
	               |			И (CRM_УсловияСрабатыванияТриггеровОбъектыОбработки.ОбъектОбработки = &ОбъектОбработки)
	               |			И (CRM_УсловияСрабатыванияТриггеровОбъектыОбработки.Ссылка.Событие = &Событие)
	               |ГДЕ
	               |	CRM_Триггеры.Действует";
	Запрос.УстановитьПараметр("ОбъектОбработки", ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Источник)));
	Запрос.УстановитьПараметр("Событие", ?(РежимПроведения = Неопределено, Перечисления.CRM_СобытияТриггеров.ПриЗаписи, Перечисления.CRM_СобытияТриггеров.ОбработкаПроведения));
	ВыборкаТриггеров = Запрос.Выполнить().Выбрать();
	Пока ВыборкаТриггеров.Следующий() Цикл
		Если ВыборкаТриггеров.УсловиеСрабатывания.ПометкаУдаления Тогда
			Справочники.CRM_Триггеры.ЗаписатьОшибкуТриггера(ВыборкаТриггеров.Ссылка, Источник, НСтр("ru='Условие срабатывания триггера помечено на удаление!';en='Trigger condition is marked for deleting!'"));
			Продолжить;
		КонецЕсли;
		Если ВыборкаТриггеров.Действие.ПометкаУдаления Тогда
			Справочники.CRM_Триггеры.ЗаписатьОшибкуТриггера(ВыборкаТриггеров.Ссылка, Источник, НСтр("ru='Действие триггера помечено на удаление!';en='This trigger action is marked for deletion!'"));
			Продолжить;
		КонецЕсли;
		Если Источник.ДополнительныеСвойства.Свойство("ВыполнениеТриггера") И Источник.ДополнительныеСвойства.ВыполнениеТриггера = ВыборкаТриггеров.Ссылка Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ Справочники.CRM_Триггеры.ПроверитьПовторноеИспользование(ВыборкаТриггеров.Ссылка, Источник) Тогда Продолжить КонецЕсли;
		ОбъектыДействия = Неопределено;
		ПроверкаПрошла = Справочники.CRM_Триггеры.ПроверитьУсловияТриггера(ВыборкаТриггеров.Ссылка, Источник, ОбъектыДействия);
		Если ПроверкаПрошла Тогда
			Если ОбъектыДействия<>Неопределено И ТипЗнч(ОбъектыДействия) = Тип("Массив") И ОбъектыДействия.Количество()>0 Тогда
				Для Каждого ОбъектДействияСсылка Из ОбъектыДействия Цикл
					Если ВыборкаТриггеров.ОтложенноеВыполнение Тогда
						ЗаписатьТриггерВОчередь(ВыборкаТриггеров.Ссылка, Источник.Ссылка, ОбъектДействияСсылка,, Истина);
						Продолжить;
					КонецЕсли;
					ОбъектДействия = ОбъектДействияСсылка.ПолучитьОбъект();
					Попытка
						СообщениеДействия = "";
						ТриггерВыполнен = Справочники.CRM_Триггеры.ВыполнитьТриггер(ВыборкаТриггеров.Ссылка, ОбъектДействия, Источник, Отказ, СообщениеДействия);
						Если ОбъектДействия.ДополнительныеСвойства.Свойство("ОбъектИзменен") Тогда
							ОбъектДействия.ДополнительныеСвойства.Удалить("ОбъектИзменен");
							ОбъектДействия.Записать();
						КонецЕсли;
						Если ТриггерВыполнен Тогда // И НЕ ВыборкаТриггеров.Ссылка.РазрешитьПовторноеСрабатывание
							Справочники.CRM_Триггеры.ЗаписатьОбработанныйОбъектТриггера(ВыборкаТриггеров.Ссылка, ОбъектДействия, Источник, СообщениеДействия);
						ИначеЕсли НЕ ТриггерВыполнен Тогда
							Справочники.CRM_Триггеры.ЗаписатьОшибкуТриггера(ВыборкаТриггеров.Ссылка, ОбъектДействия, ?(ЗначениеЗаполнено(СообщениеДействия), СообщениеДействия, "Действие не выполнено."));		
							Если ВыборкаТриггеров.ПовторятьПриОшибке > 0 Тогда
								ЗаписатьТриггерВОчередь(ВыборкаТриггеров.Ссылка, Источник.Ссылка, ОбъектДействия.Ссылка);
							Иначе	
								ДобавитьОповещениеПоТриггеру(ВыборкаТриггеров.Ссылка);
							КонецЕсли;
						КонецЕсли;
					Исключение
						Справочники.CRM_Триггеры.ЗаписатьОшибкуТриггера(ВыборкаТриггеров.Ссылка, ОбъектДействия, ОписаниеОшибки());
						Если ВыборкаТриггеров.ПовторятьПриОшибке > 0 Тогда
							ЗаписатьТриггерВОчередь(ВыборкаТриггеров.Ссылка, Источник.Ссылка, ОбъектДействия.Ссылка);
						Иначе	
							ДобавитьОповещениеПоТриггеру(ВыборкаТриггеров.Ссылка);
						КонецЕсли;
					КонецПопытки;
				КонецЦикла;
			Иначе
				Если ВыборкаТриггеров.ОтложенноеВыполнение Тогда
					ЗаписатьТриггерВОчередь(ВыборкаТриггеров.Ссылка, Источник.Ссылка, Источник.Ссылка,, Истина);
					Продолжить;
				КонецЕсли;
				Попытка
					СообщениеДействия = "";
					ТриггерВыполнен = Справочники.CRM_Триггеры.ВыполнитьТриггер(ВыборкаТриггеров.Ссылка, Источник, Источник, Отказ, СообщениеДействия);
					Если Источник.ДополнительныеСвойства.Свойство("ОбъектИзменен") Тогда
						Источник.ДополнительныеСвойства.Удалить("ОбъектИзменен");
						Источник.ДополнительныеСвойства.Вставить("ВыполнениеТриггера", ВыборкаТриггеров.Ссылка);
						Источник.Записать();
						Источник.ДополнительныеСвойства.Удалить("ВыполнениеТриггера");
					КонецЕсли;
					Если ТриггерВыполнен Тогда // И НЕ ВыборкаТриггеров.Ссылка.РазрешитьПовторноеСрабатывание
						Справочники.CRM_Триггеры.ЗаписатьОбработанныйОбъектТриггера(ВыборкаТриггеров.Ссылка, Источник, Источник, СообщениеДействия);
					ИначеЕсли НЕ ТриггерВыполнен Тогда
						Справочники.CRM_Триггеры.ЗаписатьОшибкуТриггера(ВыборкаТриггеров.Ссылка, Источник, ?(ЗначениеЗаполнено(СообщениеДействия), СообщениеДействия, "Действие не выполнено."));		
						Если ВыборкаТриггеров.ПовторятьПриОшибке > 0 Тогда
							ЗаписатьТриггерВОчередь(ВыборкаТриггеров.Ссылка, Источник.Ссылка, Источник.Ссылка);
						Иначе	
							ДобавитьОповещениеПоТриггеру(ВыборкаТриггеров.Ссылка);
						КонецЕсли;
					КонецЕсли;
				Исключение
					Справочники.CRM_Триггеры.ЗаписатьОшибкуТриггера(ВыборкаТриггеров.Ссылка, Источник, ОписаниеОшибки());
					Если ВыборкаТриггеров.ПовторятьПриОшибке > 0 Тогда
						ЗаписатьТриггерВОчередь(ВыборкаТриггеров.Ссылка, Источник.Ссылка, Источник.Ссылка);
					Иначе	
						ДобавитьОповещениеПоТриггеру(ВыборкаТриггеров.Ссылка);
					КонецЕсли;
				КонецПопытки;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

#Область ПериодическиеТриггеры

Процедура ВыполнениеПериодическогоТриггера(Параметры = Неопределено) Экспорт
	Если ОбщегоНазначения.РазделениеВключено() И Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;	
	Если Параметры = Неопределено Тогда Возврат; КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Параметры.Свойство("УникальныйИдентификаторЗадания") Тогда
		Триггер = Справочники.CRM_Триггеры.НайтиПоРеквизиту("УникальныйИдентификаторЗадания", Параметры.УникальныйИдентификаторЗадания);
		Если ЗначениеЗаполнено(Триггер) Тогда
			Попытка
				СообщениеДействия = "";
				ТриггерВыполнен = Справочники.CRM_Триггеры.ВыполнитьПериодическийТриггер(Триггер, СообщениеДействия);
				Если ТриггерВыполнен И Триггер.ВключатьВЛоги Тогда
					Справочники.CRM_Триггеры.ЗаписатьВыполнениеПериодическогоТриггера(Триггер, СообщениеДействия);
				ИначеЕсли НЕ ТриггерВыполнен Тогда
					Справочники.CRM_Триггеры.ЗаписатьОшибкуПериодическогоТриггера(Триггер, ?(ЗначениеЗаполнено(СообщениеДействия), СообщениеДействия, "Действие не выполнено."));			
				КонецЕсли;
			Исключение
				ТекстОшибки = ОписаниеОшибки();
				Справочники.CRM_Триггеры.ЗаписатьОшибкуПериодическогоТриггера(Триггер, ОписаниеОшибки());
				ВызватьИсключение ТекстОшибки;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОтложенныеТриггеры

Процедура ОтложенноеВыполнениеТриггеров(Параметры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ОчередьОтложенногоВыполненияТриггеров.Триггер КАК Триггер,
	                      |	CRM_ОчередьОтложенногоВыполненияТриггеров.ОбъектТриггера КАК ОбъектТриггера,
	                      |	CRM_ОчередьОтложенногоВыполненияТриггеров.ОбъектДействия КАК ОбъектДействия,
	                      |	CRM_ОчередьОтложенногоВыполненияТриггеров.КоличествоЗапусков КАК КоличествоЗапусков
	                      |ИЗ
	                      |	РегистрСведений.CRM_ОчередьОтложенногоВыполненияТриггеров КАК CRM_ОчередьОтложенногоВыполненияТриггеров
	                      |ГДЕ
	                      |	CRM_ОчередьОтложенногоВыполненияТриггеров.СрокВыполнения <= &СрокВыполнения");
	Запрос.УстановитьПараметр("СрокВыполнения", ТекущаяДатаСеанса());
	ВыборкаТриггеров = Запрос.Выполнить().Выбрать();
	Пока ВыборкаТриггеров.Следующий() Цикл
		Если ТипЗнч(ВыборкаТриггеров.ОбъектДействия) = Тип("ДокументСсылка.CRM_Интерес") Тогда
			Если ВыборкаТриггеров.Триггер.ВыполнятьВСостоянииИнтереса И ЗначениеЗаполнено(ВыборкаТриггеров.Триггер.СостояниеИнтереса) Тогда
				РеквизитСостоянияИЛИЭтапа = "";
				Если ТипЗнч(ВыборкаТриггеров.ОбъектДействия) = Тип("ДокументСсылка.CRM_Интерес") Тогда
					РеквизитСостоянияИЛИЭтапа = "СостояниеИнтереса";
				ИначеЕсли ТипЗнч(ВыборкаТриггеров.ОбъектДействия) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
					РеквизитСостоянияИЛИЭтапа = "CRM_ТочкаМаршрута";
				КонецЕсли;
				Если РеквизитСостоянияИЛИЭтапа <> "" И ВыборкаТриггеров.Триггер.СостояниеИнтереса <> ВыборкаТриггеров.ОбъектДействия[РеквизитСостоянияИЛИЭтапа] Тогда
					УдалитьТриггерИзОчереди(ВыборкаТриггеров.Триггер, ВыборкаТриггеров.ОбъектТриггера, ВыборкаТриггеров.ОбъектДействия);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Попытка
			ОбъектДействия = ВыборкаТриггеров.ОбъектДействия.ПолучитьОбъект();
			СообщениеДействия = "";
			Отказ = Ложь;
			ТриггерВыполнен = Справочники.CRM_Триггеры.ВыполнитьТриггер(ВыборкаТриггеров.Триггер, ОбъектДействия, ВыборкаТриггеров.ОбъектТриггера, Отказ, СообщениеДействия, Истина);
			Если ОбъектДействия.ДополнительныеСвойства.Свойство("ОбъектИзменен") Тогда
				ОбъектДействия.ДополнительныеСвойства.Удалить("ОбъектИзменен");
				ОбъектДействия.ДополнительныеСвойства.Вставить("ВыполнениеТриггера", ВыборкаТриггеров.Триггер);
				ОбъектДействия.Записать();
				ОбъектДействия.ДополнительныеСвойства.Удалить("ВыполнениеТриггера");
			КонецЕсли;
			Если ТриггерВыполнен Тогда // И НЕ ВыборкаТриггеров.Ссылка.РазрешитьПовторноеСрабатывание
				Справочники.CRM_Триггеры.ЗаписатьОбработанныйОбъектТриггера(ВыборкаТриггеров.Триггер, ОбъектДействия, ВыборкаТриггеров.ОбъектТриггера, СообщениеДействия);
				УдалитьТриггерИзОчереди(ВыборкаТриггеров.Триггер, ВыборкаТриггеров.ОбъектТриггера, ОбъектДействия.Ссылка);
			ИначеЕсли НЕ ТриггерВыполнен Тогда
				Справочники.CRM_Триггеры.ЗаписатьОшибкуТриггера(ВыборкаТриггеров.Триггер, ОбъектДействия, ?(ЗначениеЗаполнено(СообщениеДействия), СообщениеДействия, "Действие не выполнено."));		
				Если ВыборкаТриггеров.КоличествоЗапусков+1 < ВыборкаТриггеров.Триггер.ПовторятьПриОшибке Тогда
					ЗаписатьТриггерВОчередь(ВыборкаТриггеров.Триггер, ВыборкаТриггеров.ОбъектТриггера, ОбъектДействия.Ссылка, ВыборкаТриггеров.КоличествоЗапусков+1);
				Иначе	
					ДобавитьОповещениеПоТриггеру(ВыборкаТриггеров.Триггер);
					УдалитьТриггерИзОчереди(ВыборкаТриггеров.Триггер, ВыборкаТриггеров.ОбъектТриггера, ОбъектДействия.Ссылка);
					Справочники.CRM_Триггеры.ВыполнитьДействиеПриОшибке(ВыборкаТриггеров.Триггер, ОбъектДействия.Ссылка, ВыборкаТриггеров.ОбъектТриггера);
				КонецЕсли;
			КонецЕсли;
		Исключение
			Справочники.CRM_Триггеры.ЗаписатьОшибкуТриггера(ВыборкаТриггеров.Триггер, ОбъектДействия, ОписаниеОшибки());
			Если ВыборкаТриггеров.КоличествоЗапусков+1 < ВыборкаТриггеров.Триггер.ПовторятьПриОшибке Тогда
				ЗаписатьТриггерВОчередь(ВыборкаТриггеров.Триггер, ВыборкаТриггеров.ОбъектТриггера, ОбъектДействия.Ссылка, ВыборкаТриггеров.КоличествоЗапусков+1);
			Иначе
				ДобавитьОповещениеПоТриггеру(ВыборкаТриггеров.Триггер);
				УдалитьТриггерИзОчереди(ВыборкаТриггеров.Триггер, ВыборкаТриггеров.ОбъектТриггера, ОбъектДействия.Ссылка);
				Справочники.CRM_Триггеры.ВыполнитьДействиеПриОшибке(ВыборкаТриггеров.Триггер, ОбъектДействия.Ссылка, ВыборкаТриггеров.ОбъектТриггера);
			КонецЕсли;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаписатьТриггерВОчередь(Триггер, ОбъектТриггера, ОбъектДействия, НомерСрабатывания = 0, ЭтоПлановоеВыполнение = Ложь)
	
	МенеджерЗаписи = РегистрыСведений.CRM_ОчередьОтложенногоВыполненияТриггеров.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Триггер = Триггер;
	МенеджерЗаписи.ОбъектТриггера = ОбъектТриггера;
	МенеджерЗаписи.ОбъектДействия = ОбъектДействия;
	МенеджерЗаписи.КоличествоЗапусков = НомерСрабатывания;
	Если ЭтоПлановоеВыполнение Тогда
		Секунд = 1;
		Если Триггер.ОтложеноПериодичность = Перечисления.CRM_ПериодичностьОповещений.Неделя Тогда
			Секунд = 604800;
		ИначеЕсли Триггер.ОтложеноПериодичность = Перечисления.CRM_ПериодичностьОповещений.День Тогда
			Секунд = 86400;
		ИначеЕсли Триггер.ОтложеноПериодичность = Перечисления.CRM_ПериодичностьОповещений.Час Тогда
			Секунд = 3600;
		ИначеЕсли Триггер.ОтложеноПериодичность = Перечисления.CRM_ПериодичностьОповещений.Минута Тогда
			Секунд = 60;
		КонецЕсли;
		МенеджерЗаписи.СрокВыполнения = ТекущаяДатаСеанса() + Триггер.ОтложеноНа*Секунд;
	Иначе
		МенеджерЗаписи.СрокВыполнения = ТекущаяДатаСеанса() + Триггер.ПовторятьЧерез*60;
	КонецЕсли;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура УдалитьТриггерИзОчереди(Триггер, ОбъектТриггера, ОбъектДействия)
	
	МенеджерЗаписи = РегистрыСведений.CRM_ОчередьОтложенногоВыполненияТриггеров.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Триггер = Триггер;
	МенеджерЗаписи.ОбъектТриггера = ОбъектТриггера;
	МенеджерЗаписи.ОбъектДействия = ОбъектДействия;
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры

Процедура ДобавитьОповещениеПоТриггеру(Триггер)
	ТаблицаНастроекОповещений = CRM_ОповещенияСервер.ПолучитьПараметрыОповещенияПоВиду(Справочники.CRM_ВидыОповещений.ОшибкаСрабатыванияТриггера);
	МассивСтруктур = Новый Массив;
	Для Каждого СтрокаОповещения Из ТаблицаНастроекОповещений Цикл
		СтруктураОповещения = Новый Структура;
		СтруктураОповещения.Вставить("Получатель", СтрокаОповещения.Пользователь);
		СтруктураОповещения.Вставить("Предмет", Триггер);
		СтруктураОповещения.Вставить("ВидОповещения", СтрокаОповещения.ВидОповещения);
		СтруктураОповещения.Вставить("Канал", СтрокаОповещения.Канал);
		СтруктураОповещения.Вставить("СрокОповещения", СтрокаОповещения.СрокОповещения);
		СтруктураОповещения.Вставить("Периодичность", СтрокаОповещения.Периодичность);
		МассивСтруктур.Добавить(СтруктураОповещения);
	КонецЦикла;
	CRM_ОповещенияСервер.ДобавитьОповещение(МассивСтруктур);
КонецПроцедуры

#КонецОбласти

#КонецОбласти
